import java.util.Scanner;

public class classwork0908 {
    public static void main(String[] args) {
        Scanner in = new Scanner(System.in);
                /*
--------Lesson 6-Classwork-----------------------------------------------------------------------------------
         */
        //8. Даны натуральные числа от 20 до 50.Напечатать те из них, которые делятся на 3, но не делятся на 5.
        /*
        for (int i = 20;i<=50;i++){
            if (i%3==0&&i%5!=0){
                System.out.println(i);
            }
        }
         */
        /*
-------------------------------------------------------------------------------------------------------------
         */
        //9. даны натуральные числа от 35 до 87.
        //Найти и напечатать те из них, которые при делении на 7 дают остаток 1, 2 или 5.
        /*
        for (int i = 35;i<=87;i++){
            if (i%7==1||i%7==2||i%7==5){
                System.out.println(i);
            }
        }
        */
        /*
-------------------------------------------------------------------------------------------------------------
         */
        //10. Даны натуральные числа от 1 до 50. Найти сумму тех из них, которые делятся на 5 или на 7.
        /*
        int sum = 0;
        for(int i = 1;i<50;i++){
            if (i%5==0||i%7==0){
                sum+=i;
            }
        }
        System.out.println(sum);
         */
        /*
-------------------------------------------------------------------------------------------------------------
         */
        //11. Напечатать те из двузначных чисел которые делятся на 4, но не делятся на 6.
        /*
        for (int i = 10;i<=99;i++){
            if (i%4==0&&i%6!=0){
                System.out.println(i);
            }
        }
         */
        /*
------------------------------------------------------------------------------------------------------------
         */
        //12. Найти произведение двузначных нечетных чисел кратных 13.
        /*
        int multiplication = 1;
        for (int i = 10;i<=99;i++){
            if (i%13==0){
                System.out.println(i);
            }
        }
         */
        /*
-----------------------------------------------------------------------------------------------------------
         */
        //13. Найти сумму чисел от 100 до 200 кратных 17.
        /*
        for (int i = 100;i<=200;i++){
            if (i%17==0){
                System.out.println(i);
            }
        }
        */
        /*
-----------------------------------------------------------------------------------------------------------
         */
        //14. Составьте программу, которая вычисляет сумму
        //квадратов чисел от 1 до введенного вами целого числа N.
        /*
        System.out.print("Введите целое число: ");
        int num = in.nextInt();
        int sum = 0;
        for (int i = 1;i<=num;i++){
            sum+=i*i;
        }
        System.out.println(sum);
         */
        /*
----------------------------------------------------------------------------------------------------------
         */
        //17. В ЭВМ вводятся по очереди данные о росте N учащихся класса.
        //Определить средний рост учащихся класса.
        /*
        int sum = 0;
        System.out.print("Введите количество учащихся: ");
        int quantity = in.nextInt();
        int sum = 0;
        for (int i = 1;i<=quantity;i++){
            System.out.print("Введите рост учащегося в см: ");
            int  height = in.nextInt();
            sum += height;
        }
        System.out.println("Средний рост учащихся: "+(double)sum/quantity);
        */
        /*
---------------------------------------------------------------------------------------------------------
         */
        //18. Задано натуральное число N. Найти количество натуральных чисел,
        //не превосходящих N и не делящихся ни на одно из чисел 2,3,5.
        /*
        System.out.print("Введите натуральное число: ");
        int n = in.nextInt();
        int sum = 0;
        for (int i = 1;i<n;i++){
            if (i%2!=0&&i%3!=0&&i%5!=0){
                System.out.println(i);
                sum+=1;
            }
        }
        System.out.println("\nКоличество чисел не делящихся на 2,3,5: "+sum);
        */
        /*
--------------------------------------------------------------------------------------------------------
         */
        //19. Два двузначных числа, записанных одно за другим ,
        //образуют четырёхзначное число, которое делится на их произведение.
        //Найти эти числа.
        /*
        for (int i = 10;i<=99;i++){
            for (int j = 10;j<=99;j++){
                int num = 100*i+j;
                if (num % (i*j) == 0)
                    System.out.println(num);
            }
        }
         */
        /*
--------------------------------------------------------------------------------------------------------
         */
        //20. даны два двузначных числа А и В. Из этих чисел составили 2 четырехзначных числа:
        //первое число получили путем написания сначала числа А, затем В.
        //Для получения второго числа сначала записали число В, затем А.
        //Найти числа А и В если известно , что первое четырехзначное число нацело делится на 99, а второе на 49.
        /*
--------------------------------------------------------------------------------------------------------
         */
        //21. Дано натуральное n.
        //вычислить 1/(2 в квадрате) + 1/(4 в квадрате) + 1/(6 в квадрате)+ ... + 1/(n в квадрате)
        /*
        System.out.print("Введите N: ");
        int n = in.nextInt();
        double sum = 0;
        for (int i = 2;i <= n;i+=2){
            sum +=1.0/(i*i);
        }
        System.out.println(sum);
         */
        /*
---------------------------------------------------------------------------------------------------------
         */
        //28. Бизнессмен взял ссуду m тысяч рублей в банке под 20% годовых.
        //через сколько лет его долг превысит s тысяч рублей, если за это время он не будет отдавать долг.
        /*
        System.out.print("Введите m: ");
        int m = in.nextInt();
        System.out.print("Введите s: ");
        int s = in.nextInt();
        double dolg = m;
        int year = 0;
        while (dolg<=s){
            dolg = dolg * (1.0 + 3/100.0);
            year++;
        }
        System.out.println(year);
         */
        /*
---------------------------------------------------------------------------------------------------------
         */
        //29. с помощью оператора while напишите программу вывода
        //всех четных чисел в диапазоне от 2 до 100 включительно.
        /*
        int i = 2;
        while (i<=100){
            i++
            if ()
        }
        */
        /*
---------------------------------------------------------------------------------------------------------
         */
        //Начальная дистанция 1 км. Каждую неделю дистанция растет на 10%.
        //Через сколько недель дистанция превысит 10 км.
        /*
        double i = 1.0;
        int week = 0;
        while (i<10.001) {
            i *= 1.1;
            week++;
        }
        System.out.println(week);
         */
        /*
--------------------------------------------------------------------------------------------------------
         */
        //30. С помощью оператора while напишите программу определения
        //суммы всех нечетных чисел в диапазоне от 1 до 99 включительно.
        int i = 1;
        int sum = 0;
        while (i<=99){
            if (i%2!=0){
                sum+=i;
            }
            i++;
        }
        System.out.println(sum);
    }
}
